
# Задание 1 : Выбрать самого высокого используя лист
discript = [
    ["Бильбо Бэггинс", 190, 143, 51, 0],
    ["Фродо Бэггинс", 89, 153, 55, 0],
    ["Перегрин Тук", 78, 123, 49, 0],
    ["Сэмуайз Гэмджи", 75, 133, 53, 0],
    ["Смеагол", 500, 113, 25, 0]
]
max = discript[0][2]
name = discript[0][0]
for i in range(1, len(discript)):
    if discript[i][2]>max:
        max = discript[i][2]
        name = discript[i][0]
print(name)


# Задание 2 : Выбрать самого высокого используя словарь
discript2 = {
    "Бильбо Бэггинс":   { "Возраст" : 190, "Рост" : 143, "Вес" : 51,"Убито орков" : 0},
    "Фродо Бэггинс":  { "Возраст" : 89,"Рост" : 153, "Вес" : 55, "Убито орков" : 0},
    "Перегрин Тук":     { "Возраст" : 78, "Рост" : 123, "Вес" : 49,"Убито орков" : 0},
    "Сэмуайз Гэмджи":   { "Возраст" : 75,  "Рост" : 133, "Вес" : 53, "Убито орков" : 0},
    "Смеагол":       { "Возраст" : 500,  "Рост" : 113,"Вес" : 25, "Убито орков" : 0},
}

name = list(discript2.keys())
descr = discript2[name[0]]
name2 = name[0]
max2 = descr["Рост"]

for i in range(1,len(name)):
    descr = discript2[name[i]]
    if descr["Рост"] > max2:
        max2 = descr["Рост"]
        name2 = name[i]

print (name2)

# Задание 3  : Сделать запрос данных от пользователя
x = input('Введите имя и фамилию хоббита:')
print(discript2[x])